{"author":"Guest",
"title":"My 2 cents",
"text":"But in vain, for I shall never sit on the Holy Throne of thehighest priest in Lhasa nor reach that which has come down fromJenghiz Khan to the Head of our yellow Faith. I am no monk. I ama warrior and avenger.\"He jumped smartly into the saddle, whipped his horse and whirledaway, flinging out as he left the common Mongolian phrase of adieu:\"Sayn! Sayn-bayna!\"On the way back Tzeren related to us the hundreds of legendssurrounding Tushegoun Lama. One tale especially remained in mymind. It was in 1911 or 1912 when the Mongols by armed force triedto attain their liberty in a struggle with the Chinese. Thegeneral Chinese <a \r\nhref=\"http://showlace.com/\">Pittstown New York Website</a> headquarters in Western Mongolia was Kobdo, wherethey had about ten thousand soldiers under the command of theirbest officers. The command to capture Kobdo was sent <a href=\"http://centoolio.de/\">Diesel Jeans</a> to HunBaldon, a simple shepherd who had distinguished himself in fightswith the Chinese and received from the Living Buddha the title ofPrince of Hun. Ferocious, absolutely without fear and possessinggigantic strength, Baldon had several times led to the attack hispoorly armed Mongols but each time had been forced to retreat afterlosing many of his men <a href=\"http://www.dreamstock.us/\">Livres</a> under the machine-gun fire. UnexpectedlyTushegoun Lama arrived. He collected all the soldiers and thensaid to them:\"You must not fear death <a href=\"http://www.diesterwegstiftung-solingen.de/\">Stiftungsneuigkeiten Solingen</a> and must not retreat. You are fightingand dying for <a\r\nhref=\"http://www.alphatools.ca/\">Cheap Jordans</a>\r\n\r\n Mongolia, for which the gods have appointed a greatdestiny. See what the fate of Mongolia will be!\"He made a great sweeping gesture with his hand and all the soldierssaw the country round about set with rich yurtas and pasturescovered with great herds of horses and cattle. On the plainsappeared numerous horsemen on richly saddled steeds. The <a href=\"http://www.yourselfesteemcoach.com/\">Coach Outelt</a> womenwere gowned in the finest of silk with massive <a href=\"http://cocinatuidea.org/\">Cheap Jordans</a> silver rings intheir ears and precious ornaments in their elaborate head dresses. href=\"http://www.noltecanada.com/\">Canada Goose</a> undefined",
"ts":"2015-08-15T04:15:11.013-04:00 New_York",
"date":"15 8月 2015 4:15 EDT"}
