{"author":"Guest",
"title":"My 2 cents",
"text":"I realize the comment is nearly two years old so hopefully this gets seen. To the reviewer who suggested the modifications: what size pot did you use that was able to fit the smoky joe?  I looked at an 18\" tonight and don't think it would be nearly big enough.  Thanks",
"ts":"2013-09-18T20:31:18.386-04:00 New_York",
"date":"18 Sep 2013 20:31 EDT"}
{"author":"Guest (Guest)",
"title":"My 2 cents.",
"text":"Modification suggestions:  Buy the very smallest Weber grill, I think it's called \"Smokey Joe\".  Plus a small round concrete stepping stone.  And a pyrex baking dish.  \n\nSet your pot on the bricks as before but turn one inwards facing the drain hole.  Look down at the hole and push the brick in until it just closes the hole.  Mark that brick where the edge of the pot rests.  Then pull it out until the hole is half open and make another mark on the brick.  Finally pull it out until the hole is completely open and mark again.  Now you have control over the amount of air entering the cooking area.\n\nBack to the baby Weber:  stash the lid somewhere, don't assemble the legs or ash catching tray.  Lay the legs  around the bottom hole and set the tray on top.  Now the hole won't plug with ash.\n\nOpen the bottom vent on the Weber and drop it in next.  Fill with unlit charcoal and a few wood chunks then scatter 6-8 lit coals on top.  Place on the top grate of the Weber.  A nearly full Weber will last, with the brick control vent nearly closed, about 8-10 hours of no-fuss cooking time at 250F.  \n\nPlace the concrete stepping stone on the Weber's top grill.  Now you have indirect cooking, and the stone becomes another heat sink tand helps even out the temperature.\n\nThe Pyrex dish goes atop the stone, fill it with water.  Put in your replacement grill next. Close the lid and insert thermometer.\n\nLeave the bottom hole wide open until the temperature gets to 200F (about an hour) then push the brick in to the half-open point.  Add the meat and close the vent a bit more as the temperature approaches 250F.  Regulate the temperature by pushing the brick in or out.  \n\nNow you have an indirect, moist cooking environment, one that you can control the temperature too!  You won't need to open the lid again for about 8 hours at 250F. \n\nTo use as an oven, move the brick up to the replacement grill, don't add smoking wood, leave the bottom hole open and the temperature will rise to 350F.  No worry about breaking the pot since only the top rim of the Weber touches the clay pot. Bake bread, even pizza either on a pizza stone atop the stepping stone or, after cleaning, directly on the stepping stone.     \n\nHave fun!",
"ts":"2011-12-06T13:20:00-08:00 Los_Angeles"}
{"author":"Guest (Guest)",
"title":"Awesome",
"text":"People like you make america great!\n",
"ts":"2011-11-07T15:22:00-08:00 Los_Angeles"}
