{"author":"Bambam (Guest)",
"title":"BBtether",
"text":"Hi there, \nQuick thanx for some super software. Got it up and browsing with an old crapped out laptop (ubuntu 9.04) and an 8310, on movistar (Spain). If anyone needs the pppd files to make this work contact me at mad_ass_britisher@hotmail.com and i?ll send you them!\n\nThanks again",
"ts":"2009-06-15T05:19:00-07:00 Los_Angeles"}
{"author":"Guest (Guest)",
"title":"My 2 cents.",
"text":"Just thought you might want to check the pre-compiled version of pyusb on your site... I installed it on my Macbook, and now it no longer boots, it's unable to load the drivers for ANYTHING during the boot up process =[\n",
"ts":"2009-05-26T23:27:00-07:00 Los_Angeles"}
{"author":"Terrain Kain (Guest)",
"title":"Blackberry brilliance",
"text":"I have to say, I'm thrilled to have come across your site. I ended up here after perusing some forums trying to get my blackberry tether connection up and running on a Ubuntu install. Being unable to tether was the last thing that was keeping me from making the complete jump to Linux. Now, I can. \n\nYour simple script is superior to Barry in many ways. I use a pearl 8100 with version .124 and I don't know if it was my blackberry version or something with the Barry install over Ubuntu 8.10, but it just wouldn't work for the tethering. After much tweaking, I was able to dial up a connection, but shortly after I would begin doing something online, the program would be \"unable to read\" the device, throw pages upon pages of errors in the terminal, reboot my device, and eventually just die. \n\nI installed the dependencies and unpacked your script, and it worked right out of the box, no additional configuration, and best of all, no errors. \n\nSo thank you for the wonderful script to keep me connected, and I hope that you continue your work to make things.... Well... Just effing WORK. \n\nCheers!",
"ts":"2009-04-06T12:44:00-07:00 Los_Angeles"}
{"author":"Guest (Guest)",
"title":"My feelings",
"text":"I Salute to your Sound Knowledge and feel proud of you\n",
"ts":"2008-10-20T06:42:00-07:00 Los_Angeles"}
{"author":"marie-pierre (Guest)",
"title":"contact",
"text":"salut Thibaut, je cherchais comment te contacter et j'ai trouv?ce site. J'esp?e que toute la famille va bien. Amiti? Marie-Pierre\n",
"ts":"2008-07-06T13:01:00-07:00 Los_Angeles"}
{"author":"Guest (Guest)",
"title":"i think if you where in the u.s.a",
"text":"you would go far here good luck\n",
"ts":"2008-06-15T20:00:00-07:00 Los_Angeles"}
{"author":"Guest (Guest@127.0.0.1)",
"title":"My 2 cents.",
"text":"Example \n",
"ts":"2008-01-29T21:28:00-08:00 Los_Angeles"}
