{"author":"Movers",
"title":"Hassle-Free Relocation Services",
"text":"Packers and Movers Pune Charges # \r\nhttp://www.movers5th.in/packers-and-movers-pune/ \r\nPackers and Movers Mumbai Charges # \r\nhttp://www.movers5th.in/packers-and-movers-mumbai/ \r\nPackers and Movers Delhi Charges # \r\nhttp://www.movers5th.in/packers-and-movers-delhi/ ",
"ts":"2016-08-03T03:43:03.006-04:00 New_York",
"date":"03 Aug 2016 3:43 EDT"}
{"author":"Movers",
"title":"Hassle-Free Relocation Services",
"text":"Packers and Movers Bangalore Charges # \r\nhttp://www.movers5th.in/packers-and-movers-bangalore/ \r\nPackers and Movers Hyderabad Charges # \r\nhttp://www.movers5th.in/packers-and-movers-hyderabad/ \r\nPackers and Movers Gurgaon Charges # \r\nhttp://www.movers5th.in/packers-and-movers-gurgaon/",
"ts":"2016-08-03T03:42:55.644-04:00 New_York",
"date":"03 Aug 2016 3:42 EDT"}
{"author":"Movers",
"title":"Hassle-Free Relocation Services",
"text":"Packers and Movers Noida Charges @ \r\nhttp://www.movers5th.in/packers-and-movers-noida/ \r\nPackers and Movers Chennai Charges @ \r\nhttp://www.movers5th.in/packers-and-movers-chennai/ \r\nPackers and Movers Navi Mumbai Charges @ \r\nhttp://www.movers5th.in/packers-and-movers-navimumbai/ \r\nPackers and Movers Thane Charges @ \r\nhttp://www.movers5th.in/packers-and-movers-thane/ \r\nPackers and Movers Ghaziabad Charges @ \r\nhttp://www.movers5th.in/packers-and-movers-ghaziabad/ \r\nPackers and Movers Faridabad Charges @ \r\nhttp://www.movers5th.in/packers-and-movers-faridabad/",
"ts":"2016-08-03T03:42:46.402-04:00 New_York",
"date":"03 Aug 2016 3:42 EDT"}
{"author":"Movers",
"title":"Hassle-Free Relocation Services",
"text":"Packers and Movers in Hyderabad Charges @ \r\nhttp://www.moveby5th.in/packers-and-movers-hyderabad.html \r\nPackers and Movers in Pune Charges @ \r\nhttp://www.moveby5th.in/packers-and-movers-pune.html \r\nPackers and Movers in Bangalore Charges @  \r\nhttp://www.moveby5th.in/packers-and-movers-bangalore.html \r\nPackers and Movers in Delhi Charges @  \r\nhttp://www.moveby5th.in/packers-and-movers-delhi.html \r\nPackers and Movers in Gurgaon Charges @ \r\nhttp://www.moveby5th.in/packers-and-movers-gurgaon.html \r\nPackers and Movers in Mumbai Charges @  \r\nhttp://www.moveby5th.in/packers-and-movers-mumbai.html ",
"ts":"2016-08-03T03:42:32.625-04:00 New_York",
"date":"03 Aug 2016 3:42 EDT"}
{"author":"Guest",
"title":"My 2 cents",
"text":"we used a 4x2 kallax to build a room separator in our small apartment.   be careful with where you screw in the legs, some areas of the units are little more than just a cardboard honeycomb with veneer on it and the screws wont grab anything.  i strongly advise epoxying the legs to the kallax units.   with 8\" capita legs, it sits at counter height.\r\n",
"ts":"2016-03-30T21:43:41.118-04:00 New_York",
"date":"30 Mar 2016 21:43 EDT"}
{"author":"Guest",
"title":"My 2 cents",
"text":"Cool. Thank you for sharing your post. I'm inspired to got out and build my own standing table now. This standing table looks much better than the ones they have out there.",
"ts":"2015-09-05T14:47:08.61-04:00 New_York",
"date":"05 Sep 2015 14:47 EDT"}
{"author":"Guest",
"title":"My 2 cents",
"text":"I did the same build as Langdon using Kallax and Linmon. I used the plastic spacers for the Capita brackets, which I also flipped. I took a chance and drilled 3/8\" holes in the top for the bolts to go through. The whole thing is a hair over 44\" and fairly sturdy. Not sure I'd want my kid climbing on it though. Thanks!",
"ts":"2015-02-22T15:36:31.943-05:00 New_York",
"date":"22 Feb 2015 15:36 EST"}
{"author":"Jared",
"title":"Worried about purchasing from Ikea online",
"text":"I really want to build this desk and I can't find anything else like it that is non-Ikea...I've read some really nasty stories about shipping mishaps from Ikea so I'm really hesitant to buy from them. The closest store to us is about 2 hours away and I don't want to invest a whole day if I can avoid it. Where have you guys purchased your Ikea stuff for this desk - online or in-store? If so, any negatives to the process at all, whichever it is?",
"ts":"2015-01-27T16:30:26.53-05:00 New_York",
"date":"27 Jan 2015 16:30 EST"}
{"author":"Lisa",
"title":"Recommendations for 5'3\" to 5'6\".",
"text":"I am 5'3\" and my husband is 5'6\".  I really like this desk and want to build something like it.  How much height does the Capita brackets give.  Is the 6 3/4 the height it gives or is that the length of the product?",
"ts":"2014-11-21T10:47:38.412-05:00 New_York",
"date":"21 Nov 2014 10:47 EST"}
{"author":"Langdon",
"title":"Recent Build",
"text":"I just built this with the new Kallax shelving unit (202.758.85), 6.25\" Capita legs, 6.75\" Capita brackets, and a Linnmon desktop (502.513.50).  Unfortunately it's a hair less than 44\", so I need to swap my 6.25\" legs with the 8.25\" ones.\r\n\r\nI'm not using the plastic spacers on the Capital legs (which could add height) because it makes the whole thing too wobbly.",
"ts":"2014-05-15T08:18:46.21-04:00 New_York",
"date":"15 May 2014 8:18 EDT"}
{"author":"Guest",
"title":"Bookcase",
"text":"The bookcase has been renamed, according to the IKEA website, it's now called \"Kallax\". http://www.ikea.com/us/en/catalog/products/40275813/#/60275812",
"ts":"2014-04-17T09:48:48.278-04:00 New_York",
"date":"17 Apr 2014 9:48 EDT"}
{"author":"Jeff",
"title":"I made a version with a monitor shelf",
"text":"Here's a write-up on my desk which was primarily modeled after your design.  I just added a separate monitor shelf and omitted the bottom legs to lower the desk height.\r\nhttp://blog.schertz.name/2014/04/home-office-standing-desk\r\n",
"ts":"2014-04-11T15:22:08.878-04:00 New_York",
"date":"11 Apr 2014 15:22 EDT"}
{"author":"Todd",
"title":"Question for Paul",
"text":"Paul:  I am going to help a friend build one of these (already have one for myself) and I was thinking about doing the same thing with the Capita brackets you suggested.  However I  am hoping you can clarify something for me in regards to mounting them.  For the end brackets where you used T-nuts, did you slide brackets in towards the center so that the T-nuts could be used underneath the thinner top side of the bookcase (ie sandwiching the bookcase between the T-nut and the bracket) or did you somehow embed them into the thicker end panel of the bookcase?  I can't see how the second scenario could work so I'm guessing the first but wanted to be sure.  Thanks!",
"ts":"2014-03-18T17:42:40.589-04:00 New_York",
"date":"18 Mar 2014 17:42 EDT"}
{"author":"Paul",
"title":"Thank you for this great standing desk design!",
"text":"I'm standing in front of mine now as I write this!  I've been looking for a standing desk for almost 2 years now and finally came across your design a couple of weeks ago!  The only thing I did differently was, instead of drilling through the table top and having bolts showing on top, I mounted the threaded shaft of the Capita brackets through the bookcase and used tee nuts on the end brackets to secure them.  For the middle two brackets, because of the 'shelf' that runs down the middle of the bookcase they would be offset slightly to one side.  What I did to prevent this was, I just drilled in as far as necessary so the threaded shaft fit in enough to be flush with the bookcase, then used construction adhesive to secure the bracket to the bookcase.  The only thing that bugs me is the fact that the table top is hollow in spots and I'm a little worried about how long the screws they provide will hold in it.  I didn't try using the construction adhesive on those but if they start loosening, I might have to use it on them.\r\n\r\nAnyway, I was so excited about getting this desk built, that I decided to redo my whole office with the Expedit bookcases!  I also picked up a bunch of those boxes from IKEA that are designed to fit in the cubby holes of the bookcases, so I can hide all of my crap inside them!\r\n\r\nThanks again!",
"ts":"2014-03-01T16:05:39.707-05:00 New_York",
"date":"01 Mar 2014 16:5 EST"}
{"author":"Guest",
"title":"Just built mine",
"text":"I had no problem following your plan.  I altered it slightly to bring the surface up to my height (6'2\") using your suggested longer legs.  The Capita legs and brackets are available in the Ikea in San Diego, so whatever was going on with short supply in the US has abated.  I used a slightly different top.  Its a conference table(unsure of the name) 63\"x31.5\" which I found in the dings and dents section(an excellent source of Expedit pieces too).",
"ts":"2013-12-28T19:51:18.181-05:00 New_York",
"date":"28 Dec 2013 19:51 EST"}
{"author":"Guest",
"title":"My 2 cents",
"text":"Great Design! I like the idea of standing but I would also like to sit now and again, how is your leg/knee room? Is there enough clearance between the shelves and the desktop?\r\n\r\nThanks",
"ts":"2013-11-05T09:47:03.057-05:00 New_York",
"date":"05 Nov 2013 9:47 EST"}
{"author":"Guest",
"title":"My 2 cents",
"text":"I forgot to add my pics :-)\r\nhttps://twitter.com/HPRadioMedia/status/350415070498537473/photo/1\r\nhttps://twitter.com/HPRadioMedia/status/350415132846866432/photo/1\r\n\r\nI used a kitchen counter top from IKEA because I needed a ton of space to spread out. The studio racks were from my old 'sitting' desk. My plan is to get another 3 sets of angled captiva brackets and then a smaller piece of the same counter top and extend it farther off of the back to give me even more space for gear. #HPRadioMedia if anyone wants to know how I put this together. ",
"ts":"2013-06-27T20:48:43.864-04:00 New_York",
"date":"27 Jun 2013 20:48 EDT"}
{"author":"JB",
"title":"My 2 cents",
"text":"I used your plan and made a few adjustments that suited my application...recording studio. Thanks for the inspiration!!!",
"ts":"2013-06-27T20:32:24.682-04:00 New_York",
"date":"27 Jun 2013 20:32 EDT"}
{"author":"Guest",
"title":"My 2 cents",
"text":"just built mine - capita brackets are in fact still available, IKEA Stoughton, MA has them. Just ask an associate in the table area. The table tops are now called LINNMON as IKEA changed suppliers.",
"ts":"2013-04-16T15:39:23.179-04:00 New_York",
"date":"16 Apr 2013 15:39 EDT"}
{"author":"Andy",
"title":"alternate to brackets",
"text":"You could always use the capita bracket again and just flip every other so some are fastened to the base and some to the top. I'm going to do this idea my self. The main idea is to hold the top in place. You won't have the cool slanting lines but it should work. If I find another option this weekend when in Ikea I'll post it here.",
"ts":"2013-03-12T17:25:44.197-04:00 New_York",
"date":"12 Mar 2013 17:25 EDT"}
{"author":"Guest",
"title":"Where can I find the brackets?",
"text":"I was about to buy all the materials but it doesn't look like the brackets are available in the US any longer.  Any ideas?",
"ts":"2013-03-10T20:36:29.323-04:00 New_York",
"date":"10 Mar 2013 20:36 EDT"}
{"author":"Guest",
"title":"My 2 cents",
"text":"Nice !",
"ts":"2013-02-21T13:58:02.45-05:00 New_York",
"date":"21 Feb 2013 13:58 EST"}
{"author":"Vinyl Alchemist (Guest)",
"title":"Here's the picture set",
"text":"http://www.facebook.com/media/set/?set=a.4998491000432.194610.1244476057&type=1\n",
"ts":"2012-12-11T23:29:00-08:00 Los_Angeles"}
{"author":"Vinyl Alchemist (Guest)",
"title":"I made a small version with casters.",
"text":"I also made a small version with wheels.  I use it as my DJ table. Easy and fun to build. Thanks for sharing! http://www.facebook.com/media/set/edit/a.4998491000432.194610.1244476057/\n",
"ts":"2012-12-11T23:27:00-08:00 Los_Angeles"}
{"author":"Guest (Guest)",
"title":"My 2 cents.",
"text":"Great design!  Thank you for the idea.  Where did you get the monitor and monitor stand?  I have a MacBook Pro and will need similar configuration.  Cheers!\n",
"ts":"2012-11-20T17:36:00-08:00 Los_Angeles"}
{"author":"scapulator (Guest)",
"title":"little brother",
"text":"i made the smaller version of this using only 1 case\nstill an awesome desk\nhttp://i.imgur.com/IrDLj.jpg",
"ts":"2012-11-01T14:22:00-07:00 Los_Angeles"}
{"author":"Blake (Guest)",
"title":"After 8 months...",
"text":"How has this held up for you?  Just curious if you would change anything since you built?  I'm thinking about making this over the weekend.\n",
"ts":"2012-10-05T02:38:00-07:00 Los_Angeles"}
{"author":"damion (Guest)",
"title":"awesome recipe!",
"text":"I stumbled across your hack as I was looking for standing desk ideas, and I gave it a try. I'm incredibly pleased with the results!! I even wrote a blog post about it: http://mycrankygut.com/2012/09/10/its-not-always-about-cranky-guts-and-fancy-diets/ One thing you didn't mention, and I thought I should point out... when securing the nut on the middle-rear tabletop bracket, BE VERY CAREFUL NOT TO OVERTIGHTEN!! The tabletop is very flimsy at that point. Tighten the nut until it just touches the table surface!\n\nThanks for the terrific idea!!",
"ts":"2012-09-13T19:03:00-07:00 Los_Angeles"}
{"author":"Guest (Guest)",
"title":"Just built",
"text":"Just built this last weekend. Was an enjoyable process and I'm really enjoying the results. I added the two 11\" lack shelves as speaker stands and left out one of the horizontal shelves on the right side of the bookcase so that my computer could fit in that slot. Only thing that's bugging me a little bit is the desk is a little wobbly. Is anyone else having this problem? I didn't take the time to level it yet but the legs don't seem to be the problem. I wonder if it's b/c I didn't include that one shelf.\n",
"ts":"2012-08-21T23:53:00-07:00 Los_Angeles"}
{"author":"Chris (Guest)",
"title":"Screws",
"text":"What are the best types of screws to use for this material? Also, what size bolts and drill? Or do the brackets come with bolts? Planning on building this weekend. Thanks. \n",
"ts":"2012-08-13T17:18:00-07:00 Los_Angeles"}
{"author":"Guest (Guest)",
"title":"wheels",
"text":"has anyone used the wheels instead of the legs? how did it turn out? \n",
"ts":"2012-08-13T14:00:00-07:00 Los_Angeles"}
{"author":"SETH FROM NASHVILLE (Guest)",
"title":"GREAT DESIGN- NOW, LOVIN' MINE",
"text":"Thanks for the details. Enjoyed the construction, fairly easy. I did put on a 43\" Lack shelf using 2 Capita brackets. Works great for iMac and nice storage underneath too. I'm 5'8\" so I did not use the bottom legs.  Put in a 2 drawer unit and Branas basket.  Added (2) Expedit inserts with door. I put a small UPS behind the door and now have clean hidden access to power and wall warts. The only thing I might have done different is use (2) 11\" Lack shelves instead and use them as speaker stands with iMac  sitting between them. THANKS AGAIN for a truly delicious design. Peace\n",
"ts":"2012-08-07T17:19:00-07:00 Los_Angeles"}
{"author":"Charley (Guest)",
"title":"Dunn & Dunn!",
"text":"Hi. Just letting you know I built a desk using your design. Exactly the same, just using one Expedit, and a shorter Vika Amon top. So, half as wide, in other words.\n\nThe only difference was, for the front Capita brackets I kept the round discs on top of the brackets to make the desk flat back to front. I hacksawed the bolts down and drilled two pilot holes in the front underside of the desk, and the cut bolts popped into those. You gotta be careful with those Vika Amon tops, as they are hollow in the middle.\n\nBTW, I didn't use epoxy, but I did squeeze some \"no more nails\" down the screw holes to give the screws some better purchase. Both the Expedit and the Vita Amon tops are made of a composite wood material which screws can turn to sawdust over time. Especially if you over tighten them! I used a manual screwdriver for the final turns, just to make sure the drill didn't gouge the wood.\n\nThanks again for your design. The cost of the project for me was $200 (Australian)\n\n",
"ts":"2012-07-28T19:58:00-07:00 Los_Angeles"}
{"author":"M. Steve (Guest)",
"title":"Thank you so much",
"text":"We followed your plans today, and it worked out great!  I need a standing desk because of my back, and the cheapest ones I could find that didn't look like scrap metal were $400.  I already had the Expedit bookcase, so this ran about $150 total.  The 6\" legs are correct for me at 6'2\", although I spaced 4 legs evenly on each long end of the bookcase in my design.  We also shimmed the front braces to make the table level.\n\nI really appreciate your putting this guide together; do you take PayPal/Google Checkout donations?",
"ts":"2012-07-15T21:26:00-07:00 Los_Angeles"}
{"author":"Steve (Guest)",
"title":"Balance",
"text":"Looks fantastic! If the brackets beneath the table top were mounted in the same direction in order to bring the table out farther.. do you think the bookshelf would be out of balance? Thanks!\n",
"ts":"2012-07-11T20:45:00-07:00 Los_Angeles"}
{"author":"Daniel Brierton (Guest)",
"title":"Inverting Capita Brackets",
"text":"Love this design, think I'll definitely go with this for my standing desk. I'm going to flip the Capita brackets though, and place them a little bit further in, using 8 instead of 6, just for symmetry. It requires longer bolts to get through the thicker wall of the Expedit shelves, but that's easy to rectify.\n\nThanks for sharing!",
"ts":"2012-06-16T21:38:00-07:00 Los_Angeles"}
{"author":"Guest (Guest)",
"title":"Wheels",
"text":"I think I'm goign to go for these when I put this together\nhttp://www.ikea.com/us/en/catalog/products/60169977/",
"ts":"2012-06-09T16:48:00-07:00 Los_Angeles"}
{"author":"Guest (Guest)",
"title":"Big Thanks",
"text":"Thanks for this wonderful step by step build of an inexpensive way to try a standing desk,I have an injury I am hoping it will work.  bought all that you suggested with the full size book shelf as the base and no bottom legs as I am about 5'4\" tall.  I got lucky and all the parts minus the bottom legs for about 160.00 a great savings.\n",
"ts":"2012-05-28T16:29:00-07:00 Los_Angeles"}
{"author":"Guest (Guest)",
"title":"Help Please!",
"text":"Hi there. This was a very helpful article and inspired me to do a TV stand using similar components.\n\nI notice that you drilled a hole through the Vika Amon tabletop and let the bolts be visible on the top surface. I want to avoid doing that.\n\nI don't know how to mount the Vika Amon tabletop to the Capita Brackets. If I just use industrial strength glue and \"stick\" the tabletop on top of the brackets, do you think that will be enough (structural strength?) ??",
"ts":"2012-03-05T13:46:00-08:00 Los_Angeles"}
{"author":"Guest (Guest)",
"title":"My 2 cents.",
"text":"This is great. Def inspired my design on the desk below. \n\nhttp://www.ikeahackers.net/2012/01/vika-brad-standing-desk.html?m=1",
"ts":"2012-02-18T00:44:00-08:00 Los_Angeles"}
{"author":"Guest (Guest)",
"title":"Where do the Signum go?",
"text":"Very cool hack; where do the Signum go in order to hide all the wires? \n",
"ts":"2012-01-16T22:47:00-08:00 Los_Angeles"}
{"author":"Elle (Guest)",
"title":"Question about adjustment for 5'2\" (elbow is 40\")",
"text":"Looks amazing! Do you have any suggestions for short ladies?  I am 5'2\", my elbow probably needs to rest at 40\" off the ground.  Can you tell me what I should do to make it fit my needs? Thanks so much!!\n",
"ts":"2012-01-16T14:15:00-08:00 Los_Angeles"}
{"author":"Guest (Guest)",
"title":"Epoxy",
"text":"I don't know if epoxy is needed. But at least for the bottom legs I think it's a good idea. From my experience screws in particule bard or very weak if you move them laterally (like moving the desk). On the other hand adhesives like epoxy are very good at that. So i figure screws + epoxy should help. Note that Expedit material is not too bad compare to some other Ikea stuff. \n",
"ts":"2012-01-11T23:45:00-08:00 Los_Angeles"}
{"author":"shelf (Guest)",
"title":"yeahhhh bro",
"text":"i'd been planning on making something like this for a long time, i just agonise over screwing things into the expedit. might give it a go with epoxy and a 4x2 expedit. nice work bro\n",
"ts":"2012-01-11T23:24:00-08:00 Los_Angeles"}
{"author":"Guest (Guest)",
"title":"My 2 cents.",
"text":"Cool, glad you like it. I actually bought a Lak shelf too, but haven't mounted it yet as the shortest capita brackets where out of stock.\n",
"ts":"2012-01-11T11:46:00-08:00 Los_Angeles"}
{"author":"BDunk (Guest)",
"title":"I built one",
"text":"I had been looking for a design with a 44\" desk height and that would allow for two workstations.  I knew this was the one for me as soon as I saw it =]  Assembled it last night and it was well worth the effort.  I added a Lack shelf (via more Capita brackets) on top for monitors and it turned out great!  Thank you very much for sharing your project and inspiring me to build my own!\n",
"ts":"2012-01-11T11:43:00-08:00 Los_Angeles"}
{"author":"Guest (Guest)",
"title":"Monitor stand",
"text":"It's just this: http://www.amazon.com/gp/product/B0043H39WM/ref=oh_o02_s00_i00_details\n",
"ts":"2012-01-08T21:55:00-08:00 Los_Angeles"}
{"author":"BH (Guest)",
"title":"Monitor Stand on IKEA standing desk",
"text":"A very nice project.  I'm interested in the monitor stand.  how did that go together?\n",
"ts":"2012-01-08T21:35:00-08:00 Los_Angeles"}